In [1]:
import pandas as pd

In [2]:
dict1={'Roll':[11,12,13,14,15,16,17,18],
      'Name':['ssdkal','ssdop','weio','opoi','kdie','riw','aqplrid','eoworu'],
       'Marks':[78,45,65,87,34,92,21,52],
      'Address':['Pune','Mumbai','Nagpur','Pune','Mumbai','Nagpur','Pune','Mumbai']
      }

In [3]:
df=pd.DataFrame(dict1)

In [4]:
df

   Roll     Name  Marks Address
0    11   ssdkal     78    Pune
1    12    ssdop     45  Mumbai
2    13     weio     65  Nagpur
3    14     opoi     87    Pune
4    15     kdie     34  Mumbai
5    16      riw     92  Nagpur
6    17  aqplrid     21    Pune
7    18   eoworu     52  Mumbai

In [5]:
df[0]

KeyError: 0

In [7]:
df.iloc[0]

Roll           11
Name       ssdkal
Marks          78
Address      Pune
Name: 0, dtype: object

In [8]:
df.iloc[-2]

Roll            17
Name       aqplrid
Marks           21
Address       Pune
Name: 6, dtype: object

In [10]:
df.iloc[2:5]

   Roll  Name  Marks Address
2    13  weio     65  Nagpur
3    14  opoi     87    Pune
4    15  kdie     34  Mumbai

In [11]:
df.iloc[[1,5,6]]

   Roll     Name  Marks Address
1    12    ssdop     45  Mumbai
5    16      riw     92  Nagpur
6    17  aqplrid     21    Pune

In [15]:
df.iloc[[1,3,4,7]][['Roll','Address']]

   Roll Address
1    12  Mumbai
3    14    Pune
4    15  Mumbai
7    18  Mumbai

In [17]:
df.shape

(8, 4)

In [18]:
df['Blood group']=['A','AB','O-','B+','AB-','AB+','O+','B+']

In [19]:
df

   Roll     Name  Marks Address Blood group
0    11   ssdkal     78    Pune           A
1    12    ssdop     45  Mumbai          AB
2    13     weio     65  Nagpur          O-
3    14     opoi     87    Pune          B+
4    15     kdie     34  Mumbai         AB-
5    16      riw     92  Nagpur         AB+
6    17  aqplrid     21    Pune          O+
7    18   eoworu     52  Mumbai          B+

In [20]:
df.loc[len(df.index)]=[23,'pranesh',89,'kolhapur','B+']

In [21]:
df

   Roll     Name  Marks   Address Blood group
0    11   ssdkal     78      Pune           A
1    12    ssdop     45    Mumbai          AB
2    13     weio     65    Nagpur          O-
3    14     opoi     87      Pune          B+
4    15     kdie     34    Mumbai         AB-
5    16      riw     92    Nagpur         AB+
6    17  aqplrid     21      Pune          O+
7    18   eoworu     52    Mumbai          B+
8    23  pranesh     89  kolhapur          B+

In [22]:
df.shape

(9, 5)

In [23]:
df.size

45

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 9 entries, 0 to 8
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Roll         9 non-null      int64
 1   Name         9 non-null      object
 2   Marks        9 non-null      int64
 3   Address      9 non-null      object
 4   Blood group  9 non-null      object
dtypes: int64(2), object(3)
memory usage: 432.0+ bytes

In [26]:
df.describe()

            Roll      Marks
count   9.000000   9.000000
mean   15.444444  62.555556
std     3.643869  25.909029
min    11.000000  21.000000
25%    13.000000  45.000000
50%    15.000000  65.000000
75%    17.000000  87.000000
max    23.000000  92.000000

In [29]:
temp=df.drop('Roll',axis=1)

In [30]:
temp

      Name  Marks   Address Blood group
0   ssdkal     78      Pune           A
1    ssdop     45    Mumbai          AB
2     weio     65    Nagpur          O-
3     opoi     87      Pune          B+
4     kdie     34    Mumbai         AB-
5      riw     92    Nagpur         AB+
6  aqplrid     21      Pune          O+
7   eoworu     52    Mumbai          B+
8  pranesh     89  kolhapur          B+

In [31]:
df.drop(5,axis=0)

   Roll     Name  Marks   Address Blood group
0    11   ssdkal     78      Pune           A
1    12    ssdop     45    Mumbai          AB
2    13     weio     65    Nagpur          O-
3    14     opoi     87      Pune          B+
4    15     kdie     34    Mumbai         AB-
6    17  aqplrid     21      Pune          O+
7    18   eoworu     52    Mumbai          B+
8    23  pranesh     89  kolhapur          B+

In [32]:
df

   Roll     Name  Marks   Address Blood group
0    11   ssdkal     78      Pune           A
1    12    ssdop     45    Mumbai          AB
2    13     weio     65    Nagpur          O-
3    14     opoi     87      Pune          B+
4    15     kdie     34    Mumbai         AB-
5    16      riw     92    Nagpur         AB+
6    17  aqplrid     21      Pune          O+
7    18   eoworu     52    Mumbai          B+
8    23  pranesh     89  kolhapur          B+

In [33]:
df['Marks']+10

0     88
1     55
2     75
3     97
4     44
5    102
6     31
7     62
8     99
Name: Marks, dtype: int64

In [34]:
df['Marks'].mean()

62.55555555555556

In [35]:
df['Marks']<60

0    False
1     True
2    False
3    False
4     True
5    False
6     True
7     True
8    False
Name: Marks, dtype: bool

In [36]:
df[df['Marks']<60]

   Roll     Name  Marks Address Blood group
1    12    ssdop     45  Mumbai          AB
4    15     kdie     34  Mumbai         AB-
6    17  aqplrid     21    Pune          O+
7    18   eoworu     52  Mumbai          B+

In [37]:
df['Address']=='Pune'

0     True
1    False
2    False
3     True
4    False
5    False
6     True
7    False
8    False
Name: Address, dtype: bool

In [38]:
df[df['Address']=='Pune']

   Roll     Name  Marks Address Blood group
0    11   ssdkal     78    Pune           A
3    14     opoi     87    Pune          B+
6    17  aqplrid     21    Pune          O+

# mean marks from address given by the dataset

In [47]:
df

   Roll     Name  Marks   Address Blood group
0    11   ssdkal     78      Pune           A
1    12    ssdop     45    Mumbai          AB
2    13     weio     65    Nagpur          O-
3    14     opoi     87      Pune          B+
4    15     kdie     34    Mumbai         AB-
5    16      riw     92    Nagpur         AB+
6    17  aqplrid     21      Pune          O+
7    18   eoworu     52    Mumbai          B+
8    23  pranesh     89  kolhapur          B+

In [44]:
df[df['Address']=='Pune']['Marks'].mean()

62.0

In [45]:
df[df['Address']=='Mumbai']['Marks'].mean()

43.666666666666664

In [46]:
df[df['Address']=='Nagpur']['Marks'].mean()

78.5

In [48]:
df[df['Address']=='kolhapur']['Marks'].mean()

89.0

# fin out maximum marks

In [52]:
max_marks=df['Marks']==df['Marks'].max()
max_marks

0    False
1    False
2    False
3    False
4    False
5     True
6    False
7    False
8    False
Name: Marks, dtype: bool

In [55]:
df[max_marks]

   Roll Name  Marks Address Blood group
5    16  riw     92  Nagpur         AB+

# for min marks

In [57]:
min_marks=df['Marks']==df['Marks'].min()
min_marks

0    False
1    False
2    False
3    False
4    False
5    False
6     True
7    False
8    False
Name: Marks, dtype: bool

In [59]:
df[min_marks]

   Roll     Name  Marks Address Blood group
6    17  aqplrid     21    Pune          O+

# name of student having maximum marks

In [60]:
df[max_marks]

   Roll Name  Marks Address Blood group
5    16  riw     92  Nagpur         AB+

In [63]:
df[max_marks]['Name']

5    riw
Name: Name, dtype: object

In [64]:
df[max_marks]['Name'].iloc[0]

'riw'

# or

In [66]:
df[max_marks]['Name'].loc[5]

'riw'

# new dictionary

In [67]:
dict1 = {'Roll':[11,12,13,14,15,16,17,18],
         'Name':['ssdkal','ssdop','weio','opoi','kdie','riw','aqplrid','eoworu'],
         'Marks':[78,45,65,87,34,92,21,52],
         'Address':['Pune','Mumbai','Nagpur','Pune','Mumbai','Nagpur','Pune','Mumbai']}

# use indexing in the form of A,B,C,D,E,....H without using iloc

In [75]:
df=pd.DataFrame(dict1,index=['A','B','C','D','E','F','G','H'])

# find out second highest

In [85]:
df

   Roll     Name  Marks Address
A    11   ssdkal     78    Pune
B    12    ssdop     45  Mumbai
C    13     weio     65  Nagpur
D    14     opoi     87    Pune
E    15     kdie     34  Mumbai
F    16      riw     92  Nagpur
G    17  aqplrid     21    Pune
H    18   eoworu     52  Mumbai

In [86]:
df['Marks'].max()

92

In [93]:
second_highest=df[df['Marks']<df['Marks'].max()]['Marks']

In [95]:
second_highest.max()

87

In [100]:
df[df['Marks']==second_highest.max()]['Name'].iloc[0]

'opoi'

# creating function for max marks

In [103]:
def get_topper(rank):
    return df.sort_values('Marks',ascending=False).iloc[rank-1]['Name']

In [104]:
get_topper(1)

'riw'

In [105]:
get_topper(2)

'opoi'

In [106]:
get_topper(3)

'ssdkal'